actor
after
afternnon
aitport
always
American
answer
apples
arm
armchair
arrive
ask
asleep
at
athletics
aunt
awake
babies
back
bad
badminton
bag
balcony
ball
ballet
banana
bank
baseball
bathroom
batteries
beach
beans
beautician
bedroom
beer
begin
behind
Belgian
between
big
bins
Biology
birthday
biscuits
block of flats
boiled
bookcase
bookshop
boots
boring
borrow
bottle
bottom
bowling
boxes
bra
Brazil
bread
break
bridge
bright
bring
Britain
broken
budgie
build
buildings
bull
burn
bus stop
buses
butter
buy
by
cafe
cake
calculator
call
camera
cap
capital cities
carpet
carrot
carry
cassette
cat
CD
CD player
chair
change (n)
change (v)
cheap
cheese
chemist
Chemistry
cheque
chess
chicken
child
children
Chinese
choose
church
cinema
cities
clean
cleaner
cleaning
clear
clever
climb
climbing
close
closed
clothes
cloud
cloudy
coat
coffe
cold (adj)
cold (n)
colours
comb
come
comfortable
computer
computer games
contact lenses
cook
cooker
cooking
copy
correct
cost
cough
count
countries
cousin
cow
cry
cup
cupboard
cushion
cut
cycling
dance
dangerous
daughter
day
deep
Denmark
dentist
die
difficult
dining-room
dirty
dishwasher
do
doctor
dog
door
downstairs
draw
drawer
dress
drink
drive
driver
dry
dry-cleaner
duck
ear
early
east
easy
eat
egg
eight
electrician
embarassed
empty (adj)
empty (v)
English
enjoy
enough
envelope
everyone
expensive
eye
fall
family
far
fast
fat
feel
feet
film
find
finish
fire
fish and chips
flowers
fly foggy
food
foot
football
football match
for
forest
forget
forks
freezer
freezing
French
fridge
fried
friend
friendly
frightened
from
fruit
fruit salad
frying pan
full
furniture
future
garage
garden
gate
Geography
Germany
get
get up
give
glass
go
goat
goldfish
golf
good
grandchildren
granddaughter
grandfather
grandmother
grandson
grass
Greek
ground
gymnastics
hair
hairdresser
hall
hamburger
hand
happen
happy
hard
hardly any
hardly ever
hat
hate
have
head
headache
headphones
hear
heavy
helmet
help
hi
hide
high
History
Holland
hope
horse-riding
hospital
hot
hot dog
hotel
hour
house
hungry
hurt
husband
ice cream
ice-skating
ill
in
in front of
Indian
interesting
invite
ironing
island
Italy
it's
jacket
jam
Japanese
jeans
job
journalist
journey
July
jump
karate
keep
kettle
kick
kill
kind
kiss (v)
kisses
kitchen
knee
knickers
knives
know
last
late
laugh
launderette
lay
learn
leave
leg
lemon
lend
letter
library
lie down
lift
light (adj)
light (n)
listen
live
living room
look
lorry
lose
love
low
magazines
make
Maths
meals
mean
meat
mend
mice
microwave
milk
milkshake
mobile phone
months
mosque
mother
motorway
mountains
mouse
mouth
move
museum
music shop
musical instruments
names
neck
need
nephew
new
newsagent
newspapaer
next to
niece
night
night club
nobody
noise
noisy
Norwegian
nose
numbers
of office
old
on once
onion
open (adj)
open (v)
optician
oranges
outside
oven
over
oxygen
paint
pants
parents
park
parrot
party
pass
pay
pears
petrol
pets
phone (v)
photographer
photography
Physics
picture
piece
pig
pizza
places
plan
plates
play
plumber
Poland
police station
poor
Portuguese
post
post office
postman
potatoes
pottery
pretty
pull
puppy
push
put
put on
quit
rabbit
railway station
rain
raining
rat
read
receptionist
recognize
red
relatives
remember
remote control
repeat
rich
ring
river
road
roller-blading
roof
room
rug
rugby
run
Russian
sad
sailing
sales asssistant
sandwich
saucepan
sausages
save
say
school
sea
see
sel
send
shallow
sheep
shelf
hi[
shirt
shoe shop
shoes
shopping
short
shorts
shout
show
shower
shut
sing
single
sink
sister
sit down
skiing
skirt
shy
sleep
slow
small
smell
smile
smoke
smoking
snake
snowing
socks
sofa
soft
some
son 
sore throat
sorry
soup
south
spaghetti
Spain
speak
spell
spend
spider
spoons
sports
spring
stairs
stand up
start
stay
steps
stomach ache
stop
stormy
strawberries
study
stupid
suit
suitcase
sunny
supermarket
swearer
Swedish
swim
Switzerland
tale
table tennis
take
talk
tall
taxis
tea
teach
teacher
teeth
television
tell
temperature
tennis
the day after tomorrow
the day before yesterday
they're
thin
think
through
tidy up
tie
tights
tired
to
toast
toilet
tomatoes
tomorrow
tonight
toothache
traffic lights
train
trainers
travel agent
tree
trousers
try
Turkish
turn off
turn on
TV programme
twins
two
ugly
uncle
under
understand
unfriendly
unkinf
upstairs
use
vacuuming
vase
vegetables
video recored
violin
visit
wait
wake up
walk
wall
want
washing
washing-up
watch
wear
well
wet
whisper
wife
wild animals
win
window
windsurfing
windy
wine
winter
with
woman
women
wood
work
worm
worried
worse
write
wrong
yesterday
yoga
young