abbreviation
absorbed
abstract
abuse
accomplich
achieve
acquit
action
adjourn
admiral
admit
aeroplane
aggressive
air
allergic
almost
alter
aluminium foil
amateur
ambidextrous
amnesia
anaesthetic
anthropologist
antibodies
antiseptic
applicable
apply for
approximately
apron
archaeologist
arm
armpit
arrangement
arrest
artery
article
artistic
asset
astrology
attic
autobiography
autumn
avarice
average
award
baby
bad
badger
baggage reclain
bail
bank loan
bar code
bark
barrel
basically
bass
bat
beak
bean
beat
bed
bee
beef
begin
betray
binary
binoculars
biodiversity
bird
bishop
blade
blink
blunt
boar
board
boast
Boer
book
boost
boot
boredom
botany
bottle
braille
branch
brass
bread
breadcrumbs
breath
brive
bride
bridegroom
broccoli
budget
bumper
bunch
bulter
cabbage
calf
calm
camera
cancel
captain
car
car park
carburettor
care
carrot
carton
cartoon
cartridge
carve
cast
castle
cat
catch
celebrate
cell
cellar
cent
century
chair
chance
chancellor
charge
chat show
check
check in
check-out
cheese
chef
chess
chess set
chicken
chicken feed
chief constable
childish
cholera
chop
chopping board
chord
chuckle
circle
city centre
clap
classic
clause
claw
cling film
clockwork
close
clumsy
coinsidence
colander
collarless
collection
column
come
come round
come up ith
comedy
commit
comparatively
complain
complaint
compose
comprehensive
computer
conductor
conference
confess
confidential
confirm
confused
conjunction
conservation
consultant
consumption
container
content
continually
control
convenient
conversation
conviction
copier
copywriter
cordless
corner
corporate identity
counsellor
country
court
crash
cream
creep
cricket
crowd
cruise
crutch
cucumber
curator
cut out
cutlet
cycle
cynical
daisy
database
dead
deadline
deal
dear
debate
decade
deck of cards
deckchair
declare
decoder
deer
defeat
defence
deficient
deliberate
delight
demand
democracy
demolish
demolition
deny
deodorant
dependable
deposit
dermatologist
descend
desert
dessert
detergent
deterrent
detest
dial
diarrhoea
difficult
dinosaur
director
disability
disease
disguised
disobedience
disqualify
dissertation
distinguish
disturbing
disused
ditchwater
documentary
dodo
dominate
doubles
draining board
dramatic
dreary
drop in
drowsy
duel
dull
dynamic
earn
eat
economies of scale
ditor
eel
election
electric whisk
electrical
elegant
enclose
encourage
engrossed
erase
erosion
etc.
evidence
examination
exceed
exchange rate
excite
execute
executive
exhaust
exit
expedition
explain
exploitation
explosives
express
exquisite
extend
extinguish
eye
eyelash
eyelid
fade
faint
fair
faith
fall apart
fare
farm
fascinated
fascinating
fate
feather
feeling
fence
fertilizer
file
film crew
fin
financial
fin
fir
first floor
fit
five-eighths
flammable
flash
fleet
flexible
flight
fling
flock
flow
flower
foggy
follow
font
food chain
food processor
football
forecast
foreman
forge
format
fortnight
fox
fraction
fragile
frame
franc
frown
fue
funeral
funnel
game
gang
gap
garden
garlic
gas
gear
gem
general
generally
generous
genetically modified (GM)
genuine
get at
get ... down
get in touch
get out of
get round
get round to
get through to
giggle
ginger
give ... away
give up
glance
glimpse
globalization
gloomy
go back
go off
go on about
go out
go over
go through with
God
gold
goose
governor
grain
grant
grasp
grater
grave
graze
greatly
grilled
gripping
grocer
groceries
guests
gullible
gust
hair
ham
hand in
handcuffs
handset
happen
hard
hard disk
hare
harvest
hatter
hay fever
head teacher
heart
hedgehog
heel
heir
hepatitis
herb
herd
highly
hike
hill
hint
historian
hit
holiday
home
hoof
horizontal
horror
hige
humble
hunglry
hydroelectric
hypnotist
hypothesis
ideals
illegal
illiterate
impressed
income
infectious
inflammable
influence
insomnia
inspect
install
instalment
insulate
insult
insurance claim
intellectual
inteligent
intense
intimidating
introspective
invest
investigate
iris
irritating
ISP
itch
journal
journey
juvenile
key
kidney
kill
kitchen towel
knife
knuckle
laboratory
lack
lamb
lame
lanky
largely
lasagna
laughter
lawyer
lead
lep
lease
lecture
leisure
lens
let ... off
liberate
lie
life
light
limp
liquor store
lisp
listless
liver
loan shark
locked
loiter
look
loophole
lick
lung
maintain
make out
make up
malevolent
mallet
manage
manager
mane
manual
marine
market forces
marquee
mast
maternity
medal
meddie
meeting
megabyte
memeber
meningitis
merge
mesmerized
methane
midwife
millenium
miner
mineral
miss
mist
mobile
modem
model
moment
monitor
morale
mortgage
move
moving
mow
mutlet
muscles
mail
navel
neck
need
needle
nest
newspaper
newt
nostalgic
nostril
notebook
notice
nourishment
novel
novelist
nuclear
oar
observe
onyx
operation
optimist
option
orange
ore
organic
otter
outing
output
overall
overcome
overhear
overwhelm
pacifier
pack
package
package holiday
painting
pair
palm
paper
parmesan
parrot
partisan
partridge
pass
pass away
paste
pawn
paws
pay
pea
pear
peasant
pecking order
peckish
peer
pence
pentagon
period
perk
pesicide
petal
petrol
petrol engine
pheasant
philosopher
photographer
physicist
pi
piano
picture
pie
piece
pin
pinch
pip
pirate
pit
place
plaice
plea
plead
plod
poem
police officer
policy
poll
pond
pork
position
postgraduate
postman
prawn
precision
predecessor
prepare
preposition
prescription
president
pressure
prices
pride
principal
prison
private
producer
productivity
profit margins
program
prolific
proposal
prosecution
protests
prove
prune
psoriasis
phyched up
pupil
push
put ... off
put ... on
put up with
quartet
rain
range
ravioli
realistic
reception
rechargeable
recipe
reckon
recognize
rectangle
red
reduce
refreshments
refugee
register
reign
reins
release
relieved
remember
renewable
repeat
research
residues
resign
restructure
revolution
rib
rifle
ripe
roast
rock
rolling pin
romance
route
ruffle feathers
rug
rugby
rumour
rush
sabbatical
saddle
safari
sailing boat
salary
salmon
saloon
Satan
satin
sauce
sausages
saving
scale
scanner
scarce
scare
scent
science
sci-fi
score
screen
Secretary General
sedative
self-catering
seminar
senior
sense of humour
sentence
set
several
shade
shape
shin
shoal
shoe
shoestring
shop
short
shortage
shutter
sieve
sign
signalsin
sing
sit
site
sizth
skate
sketch
skilful
skilled
skim
skip
skull
slash
slice
slip road
slug
smell
smile
snigger
soap
soccer
sociologist
soft
sole
solicitor
soot
source
spacious
spaghetti
sparrow
specialism
speck
spell
spellchecker
spending
spinach
spine
spite
spoil
spokesperson
spokeswoman
sporty
sprain
spreadsheet
spring
stagger
stake
stale
stall
stammer
stationery
statistician
steak
steal
stew
stir-fried
storey
story
striking
stripe
stripes
stroke
stroll
stuff
stumble
subsidiary
suede
superior
supermarket
superstitious
supplies
support
surge
surgeon
surveillance system
suspicious
swallow
swarm
swayed
sweat
switch
syringe
takeover
talon
tangle
tank
target
tasteless
taxidermist
teeth
temple
temporary
tend
tense
term
terrifying
thigh
three-course meal
throat
throw parties
tide
timer
toast
toe
tolerant
tomato
top dog
touch
tough
tour
tow
trace
train
trainee
trainers
training
tramp
transufion
transparent
travel
tray
triangle
trick
trip
triplets
tripod
trout
truncheon
trunk
tuna
tune
tuner
turn ... down
tusk
twig
twins
unmpire
unclear
underdraguate
understudy
undisciplined
unexpected
unhelpful
unicorn
unreasonable
unreliable
unsure
vacation
vacuum cleaner
veal
vein
venison
verdict
versatile
verse
vice chancellor
video camera
viewfinder
villa
voluntary
voyage
wages
wander
war film
warehouse
watch
way
weary
wedding
weigh
weird
whale
while
whisker
whisper
widow
wildlife programme
wind turbine
window
wink
witness
wok
woodpecker
wooly jumper
word processing
workforce
works out
writer
yelled
